brew "shellcheck"
brew "actionlint"
brew "xz"
brew "arduino-cli"
brew "cocoapods"
brew "coreutils"
brew "cppcheck"
brew "docker"
brew "fastlane"
brew "ffmpeg"
brew "flyctl"
brew "gh"
brew "git-lfs"
brew "gitleaks"
brew "go"
brew "golangci-lint"
brew "gosec"
brew "govulncheck"
brew "imagemagick"
brew "ios-deploy"
brew "lcov"
brew "node"
brew "numpy"
brew "php"
brew "python@3.14"
brew "pipx"
brew "platformio"
brew "postgresql@14", restart_service: :changed
brew "python-tk@3.14"
brew "python@3.13"
brew "samba"
brew "sonar-scanner"
brew "sqlc"
brew "swiftlint"
brew "trufflehog"
brew "watchman"
cask "android-commandlinetools"
cask "android-platform-tools"
cask "docker-desktop"
cask "flutter"
cask "kicad"
cask "kitty"
cask "temurin"
go "github.com/rhysd/actionlint/cmd/actionlint"
go "github.com/boinger/confvis/cmd/confvis"
go "golang.org/dl/go1.25.7"
go "golang.org/dl/go1.25.8"
go "golang.org/x/tools/cmd/goimports"
go "github.com/pressly/goose/v3/cmd/goose"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/sqlc-dev/sqlc/cmd/sqlc"
uv "aider-chat", with: ["pip"]
